# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Fixed-size YOLOv8n ablation for SparseSubpixelExpert hosted by C2f-style shells.

nc: 80
depth_multiple: 0.33
width_multiple: 0.25
max_channels: 1024

visdrone_attack:
  tiny_cls_ids: [0, 1]
  tiny_area: 1024
  tiny_height: 20
  tiny_repeat: 1
  tiny_repeat_cap: 2
  tiny_scale_prob: 0.5
  tiny_scale_gain: 1.08
  max_scale_gain: 1.12

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, SFRC2f, [128, True, 0.5, 8, 0.25, 1, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, SFRC2f, [256, True, 0.5, 4, 0.25, 1, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, SFRC2f, [512, True, 0.5, 4, 0.20, 1, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, SFRC2f, [1024, True, 0.5, 4, 0.20, 1, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, SFRC2f, [512, False, 0.5, 4, 0.20, 1, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, SFRC2f, [256, False, 0.5, 4, 0.375, 1, False]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, SFRC2f, [512, False, 0.5, 4, 0.20, 1, False]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, SFRC2f, [1024, False, 0.5, 4, 0.20, 1, False]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]
