# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Rebuilt YOLO11n SFR full variant for VisDrone.

nc: 80
depth_multiple: 0.50
width_multiple: 0.25

tiny_obj:
  enabled: True
  cls_ids: [0, 1]
  area: 1024
  height: 20
  box_gain: 2.0
  cls_gain: 1.5
  one2many_topk: 16
  one2one_topk: 9
  one2one_topk2: 1
  assigner_beta: 7.0

router_aux:
  enabled: True
  gain: 0.20
  pos_weight: 5.0
  neg_weight: 1.0
  dice_gain: 0.15
  density_gain: 0.05

visdrone_attack:
  tiny_cls_ids: [0, 1]
  tiny_area: 1024
  tiny_height: 20
  tiny_repeat: 1
  tiny_repeat_cap: 2
  tiny_scale_prob: 0.5
  tiny_scale_gain: 1.08
  max_scale_gain: 1.12

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, SFRC2fFull, [256, False, 0.25, 8, 0.25, 0, True, 0.45, 0.00]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, SFRC2fFull, [512, False, 0.25, 4, 0.25, 0, True, 0.45, 0.00]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, SFRC2fFull, [512, False, 0.5, 4, 0.20, 0, False, 0.45, 0.00]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, SFRC2fFull, [256, False, 0.5, 4, 0.375, 0, False, 0.40, 0.00]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 1, SFRC2fFull, [512, False, 0.5, 4, 0.20, 0, False, 0.45, 0.00]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
