# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Shadow-Pyramid Distilled YOLO26n for VisDrone.
# Student keeps a lightweight P3-P5 detector with a selective P2 bridge.
# Teacher exists only during training and uses a denser P2 detector.

nc: 80
end2end: True
reg_max: 1
depth_multiple: 0.50
width_multiple: 0.25

tiny_obj:
  enabled: True
  cls_ids: [0, 1]
  area: 1024
  height: 20
  box_gain: 2.0
  cls_gain: 1.5
  one2many_topk: 16
  one2one_topk: 9
  one2one_topk2: 1
  assigner_beta: 7.0

shadow_distill:
  enabled: True
  teacher_model: ultralytics/cfg/models/26/yolo26n-p2-visdrone.yaml
  teacher_weights: yolo26n.pt
  cls_ids: [0, 1]
  area: 1024
  height: 20
  density_gain: 0.75
  feature_gain: 0.25
  crowd_gain: 0.35
  crowd_radius: 1

visdrone_attack:
  tiny_cls_ids: [0, 1]
  tiny_area: 1024
  tiny_height: 20
  tiny_repeat: 1
  tiny_repeat_cap: 2
  tiny_scale_prob: 0.5
  tiny_scale_gain: 1.08
  max_scale_gain: 1.12

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 1, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C3k2, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]] # 16 (P3/8-small)

  - [[2, 16], 1, ScaleSelectiveFusion, [256, 0.5, 4, 0.125, 1]] # 17 selective P2->P3 bridge

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 1, C3k2, [512, True]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]
