# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Perspective-Scale Routed YOLO26 for VisDrone tiny-person detection.
# V2 trades some deep-channel width for routed detail recovery so the tiny-person pathway is cheaper than the baseline.

nc: 80
end2end: True
reg_max: 1
tiny_obj:
  enabled: True
  cls_ids: [0, 1]
  area: 1024
  height: 20
  box_gain: 1.5
  cls_gain: 1.25
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, SFRC2f, [224, False, 0.5, 8, 0.25, 1, True]]
  - [-1, 1, Conv, [224, 3, 2]] # 3-P3/8
  - [-1, 1, SFRC2f, [448, False, 0.5, 4, 0.25, 1, True]]
  - [-1, 1, Conv, [448, 3, 2]] # 5-P4/16
  - [-1, 1, C3k2, [448, True]]
  - [-1, 1, Conv, [896, 3, 2]] # 7-P5/32
  - [-1, 1, C3k2, [896, True]]
  - [-1, 1, SPPF, [896, 5, 3, True]]
  - [-1, 2, C2PSA, [896]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, SFRC2f, [448, True, 0.375, 4, 0.20, 1, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, SFRC2f, [224, True, 0.375, 4, 0.375, 1, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [224, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 1, SFRC2f, [384, True, 0.375, 4, 0.20, 1, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [768, True, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]
