# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Fixed-size YOLO12n ablation for SparseSubpixelExpert on C3k2-compatible stages.
# A2C2f stages are intentionally kept unchanged in this first transfer build.

nc: 80
depth_multiple: 0.50
width_multiple: 0.25
max_channels: 1024

visdrone_attack:
  tiny_cls_ids: [0, 1]
  tiny_area: 1024
  tiny_height: 20
  tiny_repeat: 1
  tiny_repeat_cap: 2
  tiny_scale_prob: 0.5
  tiny_scale_gain: 1.08
  max_scale_gain: 1.12

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, SFRC2f, [256, False, 0.25, 8, 0.25, 1, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 1, SFRC2f, [512, False, 0.25, 4, 0.25, 1, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, A2C2f, [1024, True, 1]] # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]] # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 1, SFRC2f, [1024, True, 0.5, 4, 0.20, 1, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]
